// 42以前のNORMALについては割愛
// 42. オブジェクトのプロパティの値取得2
// const object = {name: "Bob", "age": 20};

// const getObjectName = (object) => {
//     return object.name
// }

// 43. オブジェクトのプロパティの値を更新する②
// const library = {
//     book: {
//        author: "Tom Sawyer",
//        year: "10/22/1876"
//      }
//   }

// 44.オブジェクトのageプロパティの値を関数を使って、+1増やして、ログに出力しよう
// const object = {age: 35, weight: 80}
// const plusAge = (object) => {
//     while(object.age <= 100){
//         console.log(object.age)
//         object.age = object.age + 1
//     }
// }
// plusAge(object)


//45. 関数の引数にオブジェクトと値を渡すとプロパティweightとその値を追加する関数を作成し、ログに出力してみよう
// const person = {name: "Bob", age: 35}
// // ここから処理を書いてください。
// const addWeight = (personObject, weightNum) => {
//     personObject.weight = weightNum
//     return personObject
// }
// console.log(addWeight(person, 50))



//46 オブジェクトのプロパティに複数の値を持つhobby配列を追加する
// const object = { name: "Bob", age: 35 };
// if (confirm("削除してもよろしいですか？")) {
//   delete object.name;
//   console.log(object);
// } else {
//   console.log(object);
// }

//47 オブジェクトのnameプロパティを削除する前に実行確認した上で、OKの場合のみ削除されるようにしよう


//48 引数にオブジェクトと消去したいプロパティ名を渡すことでオブジェクトのプロパティを削除することができる関数を作成し、ログ出力でプロパティが削除できたことを確認する


//60 配列の最後に文字列要素"すいか"を追加する


//61 配列の最後の要素を削除する


//62 配列の最初に文字列要素"すいか"を追加する


//63 配列の最初の要素を削除する


//64 配列から"みかん"のindexを取得する


//65 配列に"りんご"が含まれているか確かめる


//66 配列の2番目の要素と3番目の要素からなる配列を作る


//67 配列の3番目の要素を削除する


//68 配列のそれぞれの要素をログ出力する


//69 配列のそれぞれの要素を2倍にしてログ出力する


//70 配列のそれぞれの要素を3倍に加工した配列を取得する


//71 配列の中で3文字の要素のみに絞り込んだ配列を取得する


//72 オブジェクト配列からあるプロパティのみの配列を取得する


//73 文字コード順に並べ替える


//74 文字コード順に並べ替える


//75 文字コード順に並べ替える


//76 文字コード順に並べ替える


//77 文字コード順に並べ替える


//78 文字コード順に並べ替える


//83 配列オブジェクトから特定のオブジェクト取得


//84 配列オブジェクト絞り込み取得1


//85 配列オブジェクト絞り込み取得2


//86 配列オブジェクト絞り込み取得2


//87 配列オブジェクト絞り込み取得2


//88 配列オブジェクトのプロパティ値更新


//89 配列オブジェクトのプロパティ値更新